app/views/comments/_comment.html.erb

      <div class='comment-author'>
        <strong><%="#{comment.user.firstName} #{comment.user.lastName}" %></strong>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]