app/views/posts/show.html.erb

  <div class=' post-comment-container' id='comments'>
    <h4 class='grey-text center-align'><%= pluralize @post.comments.count, 'Comment' %></h4>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]