app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "comment", "created_at", "updated_at", "post_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Vedant Shetty"], ["comment", "rfrsf"], ["created_at", "2020-02-03 12:33:44.829084"], ["updated_at", "2020-02-03 12:33:44.829084"], ["post_id", 1]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(whitelisted_comment_params)