app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order('created_at DESC')
---
SELECT "posts".* FROM "posts" WHERE ('2020-02-04 07:43:40.973214'<=created_at+30) ORDER BY created_at DESC

  def create
    @post = Post.new(whitelisted_post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Third Post"], ["created_at", "2020-02-04 06:04:03.394249"], ["updated_at", "2020-02-04 06:04:03.394249"]]

  def update
    if @post.update(whitelisted_post_params)
---
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "rddg"], ["updated_at", "2020-02-03 12:33:34.455189"], ["id", 1]]